// 角色天赋数据

/**
 * 在desc中 可以使用以下标签
 * <bold>文字强调</bold>
 * <pyro>火元素伤害</pyro>
 * <hydro>水元素伤害</hydro>
 * <geo>岩元素伤害</geo>
 * <electro>雷元素伤害</electro>
 * <cyro>冰元素伤害</cyro>
 * <ameno>风元素伤害</ameno
 */
export default {
  element: 'pyro',  // 元素 参考上方标签名称
  data: [
    {
      title: '普通攻击·火漆制印',
      image: '/image/char/talent/Skill_A_05.png',
      desc: [
        '<bold>普通攻击</bold>',
        '连续发射火球，造成最多三段的<pyro>火元素伤害</pyro>。普通攻击命中敌人时，会赋予烟绯一枚丹火印。初始最多持有三枚丹火印，每次触发都会刷新已有的丹火印持续时间。',
        '每枚丹火印都会降低烟绯的体力消耗，并会在烟绯退场时消失。',
        '',
        '<bold>重击</bold>',
        '消耗体力,短暂咏唱后，消耗所有的丹火印，在前方造成<pyro>火元素范围伤害</pyro>。',
        '根据被消耗的丹火印数量，强化这次重击的范围与伤害。',
        '',
        '<bold>下落攻击</bold>',
        '凝聚火元素的力量，从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成<pyro>火元素范围伤害</pyro>。'
      ],
      data: [
        {
            "title":"一段伤害",
            "data":[
                "58.34%",
                "62.72%",
                "67.09%",
                "72.93%",
                "77.3%",
                "81.68%",
                "87.51%",
                "93.35%",
                "99.18%",
                "105.01%",
                "110.85%",
                "116.68%",
                "123.98%",
                "131.27%",
                "138.56%"
            ]
        },
        {
            "title":"二段伤害",
            "data":[
                "52.13%",
                "56.04%",
                "59.94%",
                "65.16%",
                "69.07%",
                "72.98%",
                "78.19%",
                "83.4%",
                "88.61%",
                "93.83%",
                "99.04%",
                "104.25%",
                "110.77%",
                "117.28%",
                "123.8%"
            ]
        },
        {
            "title":"三段伤害",
            "data":[
                "76.01%",
                "81.71%",
                "87.41%",
                "95.02%",
                "100.72%",
                "106.42%",
                "114.02%",
                "121.62%",
                "129.22%",
                "136.82%",
                "144.42%",
                "152.03%",
                "161.53%",
                "171.03%",
                "180.53%"
            ]
        },
        {
            "title":"重击伤害",
            "data":[
                "98.23% / 115.56% / 132.9% / 150.23% / 167.57%",
                "104.11% / 122.48% / 140.86% / 159.23% / 177.6%",
                "109.99% / 129.4% / 148.81% / 168.23% / 187.64%",
                "117.64% / 138.4% / 159.16% / 179.92% / 200.68%",
                "123.52% / 145.32% / 167.12% / 188.92% / 210.71%",
                "129.4% / 152.24% / 175.08% / 197.91% / 220.75%",
                "137.05% / 161.24% / 185.42% / 209.61% / 233.79%",
                "144.7% / 170.23% / 195.77% / 221.3% / 246.84%",
                "152.34% / 179.23% / 206.11% / 233% / 259.88%",
                "159.99% / 188.22% / 216.46% / 244.69% / 272.92%",
                "167.64% / 197.22% / 226.8% / 256.39% / 285.97%",
                "175.28% / 206.22% / 237.15% / 268.08% / 299.01%",
                "182.93% / 215.21% / 247.49% / 279.78% / 312.06%",
                "190.58% / 224.21% / 257.84% / 291.47% / 325.1%",
                "198.22% / 233.2% / 268.18% / 303.17% / 338.15%"
            ]
        },
        {
            "title":"重击体力消耗",
            "data":[
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50",
                "50"
            ]
        },
        {
            "title":"丹火印降低体力消耗",
            "data":[
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%",
                "每枚15.0%"
            ]
        },
        {
            "title":"丹火印持续时间",
            "data":[
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒",
                "10.0秒"
            ]
        },
        {
            "title":"下坠期间伤害",
            "data":[
                "56.83%",
                "61.45%",
                "66.08%",
                "72.69%",
                "77.31%",
                "82.6%",
                "89.87%",
                "97.14%",
                "104.41%",
                "112.34%",
                "120.27%",
                "128.2%",
                "136.12%",
                "144.05%",
                "151.98%"
            ]
        },
        {
            "title":"低空/高空坠地冲击伤害",
            "data":[
                "113.63% / 141.93%",
                "122.88% / 153.49%",
                "132.13% / 165.04%",
                "145.35% / 181.54%",
                "154.59% / 193.1%",
                "165.17% / 206.3%",
                "179.7% / 224.45%",
                "194.23% / 242.61%",
                "208.77% / 260.76%",
                "224.62% / 280.57%",
                "240.48% / 300.37%",
                "256.34% / 320.18%",
                "272.19% / 339.98%",
                "288.05% / 359.79%",
                "303.9% / 379.59%"
            ]
        }
      ]
    },
    {
      title: '丹书立约',
      image: '/image/char/talent/UI_Talent_U_Yanfei_01.png',
      desc: [
        '唤出烈焰,造成<pyro>火元素范围伤害。</pyro>',
        '命中敌人后，会为烟绯赋予最大数量的丹火印。',
        '',
        '以火烧制的印除了法律效应之外，还带着烟绯自己的附加条款。毕竟自然法则只靠总务司是改不掉的。'
      ],
      data: [
        {
            "title":"技能伤害",
            "data":[
                "169.6%",
                "182.32%",
                "195.04%",
                "212%",
                "224.72%",
                "237.44%",
                "254.4%",
                "271.36%",
                "288.32%",
                "305.28%",
                "322.24%",
                "339.2%",
                "360.4%",
                "381.6%",
                "402.8%"
            ]
        },
        {
            "title":"冷却时间",
            "data":[
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒",
                "9.0秒"
            ]
        }
      ]
    },
    {
      title: '凭此结契',
      image: '/image/char/talent/UI_Talent_U_Yanfei_02.png',
      desc: [
        '引发喷薄爆发的烈火，冲击周围的敌人，造成<pyro>火元素范围伤害</pyro>，并为烟绯自己赋予最大数量的丹火印与灼灼效果。',
        '',
        '灼灼',
        '具有如下效果',
        '·每隔一段时间，为烟绯赋予一枚丹火印；',
        '·提高重击造成的伤害。',
        '灼灼效果会在烟绯退场与倒下时移除。',
        '',
        '「条款齐备,依此立下生死之契。当然,是你死我生啦!」'
      ],
      data: [
        {
          "title":"技能伤害",
          "data":[
            "182.4%",
            "196.08%",
            "209.76%",
            "228%",
            "241.68%",
            "255.36%",
            "273.6%",
            "291.84%",
            "310.08%",
            "328.32%",
            "346.56%",
            "364.8%",
            "387.6%",
            "410.4%",
            "433.2%"
        ]
      },
      {
          "title":"丹火印赋予间隔",
          "data":[
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒",
              "1.0秒"
          ]
      },
      {
          "title":"重击伤害提升",
          "data":[
          ]
      },
      {
          "title":"持续时间",
          "data":[
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30"
          ]
      },
      {
          "title":"冷却时间",
          "data":[
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒",
              "20.0秒"
          ]
      },
      {
          "title":"元素能量",
          "data":[
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80",
              "80"
          ]
       }
      ]
    },
    {
      title: '关联条款',
      image: '/image/char/talent/UI_Talent_S_Yanfei_05.png',
      desc: [
        '烟绯通过重击消耗丹火印时，每枚丹火印会提升烟绯5%的<pyro>火元素伤害加成</pyro>，持续6秒。该效果的持续时间内重复触发时，会先移除原有的效果。'
      ],
      data: null
    },
    {
      title: '法兽灼眼',
      image: '/image/char/talent/UI_Talent_S_Yanfei_06.png',
      desc: [
        '烟绯主动施放的重击造成暴击时，会额外造成一次80%攻击力的<pyro>火元素范围伤害</pyro>。该伤害视为重击伤害。'
      ],
      data: null
    },
    {
      title: '博闻强记',
      image: '/image/char/talent/无.png',
      desc: [
        '在小地图上显示周围的<bold>璃月区域特产</bold>的位置'
      ],
      data: null
    }
  ]
}
