// 角色天赋数据

/**
 * 在desc中 可以使用以下标签
 * <bold>文字强调</bold>
 * <pyro>火元素伤害</pyro>
 * <hydro>水元素伤害</hydro>
 * <geo>岩元素伤害</geo>
 * <electro>雷元素伤害</electro>
 * <cyro>冰元素伤害</cyro>
 * <ameno>风元素伤害</ameno
 */
export default {
  element: 'pyro',  // 元素 参考上方标签名称
  data: [
    {
      title: '普通攻击·往生秘传枪法',
      image: '/image/char/talent/Skill_A_03.png',
      desc: [
        '<bold>普通攻击</bold>',
        '进行至多六段的连续枪击。',
        '',
        '<bold>重击</bold>',
        '消耗一定体力，向前方突进，对路径上的敌人造成伤害。',
        '',
        '<bold>下落攻击</bold>',
        '从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成范围伤害。'
      ],
      data: [
        {
          title: '一段伤害',
          data: [
            '46.89%',
            '50.08%',
            '53.28%',
            '57.54%',
            '60.74%',
            '64.47%',
            '69.26%',
            '74.06%',
            '78.85%',
            '83.65%',
            '88.44%',
            '93.24%',
            '98.04%',
            '102.83%',
            '107.63%'
          ]
        },
        {
          title: '二段伤害',
          data: [
            '48.25%',
            '51.54%',
            '54.83%',
            '59.22%',
            '62.51%',
            '66.35%',
            '71.28%',
            '76.22%',
            '81.15%',
            '86.09%',
            '91.02%',
            '95.96%',
            '100.89%',
            '105.83%',
            '110.76%'
          ]
        },
        {
          title: '三段伤害',
          data: [
            '61.05%',
            '65.21%',
            '69.38%',
            '74.93%',
            '79.09%',
            '83.94%',
            '90.19%',
            '96.43%',
            '102.68%',
            '108.92%',
            '115.16%',
            '121.41%',
            '127.65%',
            '133.89%',
            '140.14%'
          ]
        },
        {
          title: '四段伤害',
          data: [
            '65.64%',
            '70.12%',
            '74.59%',
            '80.56%',
            '85.03%',
            '90.26%',
            '96.97%',
            '103.68%',
            '110.40%',
            '117.11%',
            '123.82%',
            '130.54%',
            '137.25%',
            '143.96%',
            '150.68%'
          ]
        },
        {
          title: '五段伤害',
          data: [
            '33.27%+35.2%',
            '35.54%+37.6%',
            '37.81%+40%',
            '40.84%+43.2%',
            '43.1%+45.6%',
            '45.75%+48.4%',
            '49.15%+52%',
            '52.56%+55.6%',
            '55.96%+59.2%',
            '59.36%+62.8%',
            '62.77%+66.4%',
            '66.17%+70%',
            '69.57%+73.6%',
            '72.98%+77.2%',
            '76.38%+80.8%'
          ]
        },
        {
          title: '六段伤害',
          data: [
            '85.96%',
            '91.82%',
            '97.68%',
            '105.49%',
            '111.36%',
            '118.19%',
            '126.98%',
            '135.78%',
            '144.57%',
            '153.36%',
            '162.15%',
            '170.94%',
            '179.73%',
            '188.52%',
            '197.31%'
          ]
        },
        {
          title: '重击伤害',
          data: [
            '135.96%',
            '145.23%',
            '154.50%',
            '166.86%',
            '176.13%',
            '186.95%',
            '200.85%',
            '214.76%',
            '228.66%',
            '242.57%',
            '256.47%',
            '270.38%',
            '284.28%',
            '298.19%',
            '312.09%'
          ]
        },
        {
          title: '重击体力消耗',
          data: [
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点',
            '25.0点'
          ]
        },
        {
          title: '下坠期间伤害',
          data: [
            '65.42%',
            '69.88%',
            '74.34%',
            '80.29%',
            '84.75%',
            '89.95%',
            '96.64%',
            '103.33%',
            '110.02%',
            '116.71%',
            '123.40%',
            '130.10%',
            '136.79%',
            '143.48%',
            '150.17%'
          ]
        },
        {
          title: '低空/高空坠地冲击伤害',
          data: [
            '130.81%/163.39%',
            '139.73%/174.53%',
            '148.65%/185.67%',
            '160.54%/200.52%',
            '169.46%/211.66%',
            '179.86%/224.66%',
            '193.24%/241.37%',
            '206.62%/258.08%',
            '220%/274.79%',
            '233.38%/291.5%',
            '246.76%/308.21%',
            '260.13%/324.92%',
            '273.51%/341.63%',
            '286.89%/358.34%',
            '300.27%/375.05%'
          ]
        }
      ]
    },
    {
      title: '蝶引来生',
      image: '/image/char/talent/UI_Talent_U_Hutao_01.png',
      desc: [
        '只有永不间断的烈焰可以洗净世间的不净之物。',
        '胡桃消耗一部分生命值，击退周围敌人，进入彼岸蝶舞状态。',
        '',
        '<bold>彼岸蝶舞</bold>',
        '·基于进入该状态时胡桃的生命值上限，提高胡桃的攻击力。通过这种方式获得的攻击力提升。不能超过胡桃基础攻击力的400%；',
        '·将攻击伤害转为<pyro>火元素伤害</pyro>，该元素转化无法被附魔覆盖；',
        '·重击会为命中的敌人施加血梅香效果；',
        '·提高胡桃的抗打断能力。',
        '',
        '<bold>血梅香</bold>',
        '处于血梅香状态下的敌人，每4秒会受到一次<pyro>火元素伤害</pyro>。这个伤害视为元素战技伤害。',
        '同一个目标身上只能存在一个血梅香效果，且只能被胡桃自己刷新持续时间。',
        '',
        '<bold>彼岸蝶舞</bold>将在持续时间结束、胡桃下场或倒下时解除。',
        '',
        '胡桃所习得的秘传枪法，其口诀第一句是：「枪开黄泉路，蝶引来世桥。」'
      ],
      data: [
        {
          title: '技能消耗(当前生命值)',
          data: [
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%',
            '30%'
          ]
        },
        {
          title: '攻击力提高(生命值上限)',
          data: [
            '3.84%',
            '4.07%',
            '4.3%',
            '4.6%',
            '4.83%',
            '5.06%',
            '5.36%',
            '5.66%',
            '5.96%',
            '6.26%',
            '6.56%',
            '6.85%',
            '7.15%',
            '7.45%',
            '7.75%'
          ]
        },
        {
          title: '血梅香伤害',
          data: [
            '64%',
            '68.8%',
            '73.6%',
            '80%',
            '84.8%',
            '89.6%',
            '96%',
            '102.4%',
            '108.8%',
            '115.2%',
            '121.6%',
            '128%',
            '136%',
            '144%',
            '152%'
          ]
        },
        {
          title: '血梅香持续时间',
          data: [
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒'
          ]
        },
        {
          title: '持续时间',
          data: [
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒',
            '9.0秒'
          ]
        },
        {
          title: '冷却时间',
          data: [
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒',
            '16.0秒'
          ]
        }
      ]
    },
    {
      title: '安神秘法',
      image: '/image/char/talent/UI_Talent_U_Hutao_02.png',
      desc: [
        '挥动炽热的魂灵，造成大范围<pyro>火元素伤害</pyro>。',
        '命中敌人时，基于胡桃的生命值上限，恢复胡桃的生命值。这个效果最多对5个命中的敌人生效',
        '如果技能命中时胡桃的生命值低于或等于50%，则造成更高的伤害与治疗量',
        '已经离开人世之物如果还在活蹦乱跳，就会让往生堂十分焦虑。火葬是最能让胡桃安定心神的手段，而她越焦虑，火力就越大。'
      ],
      data: [
        {
          title: '技能伤害',
          data: [
            '303.27%',
            '321.43%',
            '339.59%',
            '363.2%',
            '381.36%',
            '399.52%',
            '423.13%',
            '446.74%',
            '470.34%',
            '493.95%',
            '517.56%',
            '541.17%',
            '564.78%',
            '588.38%',
            '611.99%'
          ]
        },
        {
          title: '低血量时技能伤害',
          data: [
            '379.09%',
            '401.79%',
            '424.49%',
            '454%',
            '476.7%',
            '499.4%',
            '528.91%',
            '558.42%',
            '587.93%',
            '617.44%',
            '646.95%',
            '676.46%',
            '705.97%',
            '735.48%',
            '764.99%'
          ]
        },
        {
          title: '技能治疗量(生命值上限)',
          data: [
            '6.26%',
            '6.64%',
            '7.01%',
            '7.5%',
            '7.88%',
            '8.25%',
            '8.74%',
            '9.23%',
            '9.71%',
            '10.2%',
            '10.69%',
            '11.18%',
            '11.66%',
            '12.15%',
            '12.64%'
          ]
        },
        {
          title: '低血量时技能治疗量(生命值上限)',
          data: [
            '8.35%',
            '8.85%',
            '9.35%',
            '10%',
            '10.5%',
            '11%',
            '11.65%',
            '12.3%',
            '12.95%',
            '13.6%',
            '14.25%',
            '14.9%',
            '15.55%',
            '16.2%',
            '16.85%'
          ]
        },
        {
          title: '冷却时间',
          data: [
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒'
          ]
        },
        {
          title: '元素能量',
          data: [
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60'
          ]
        },
      ]
    },
    {
      title: '蝶隐之时',
      image: '/image/char/talent/UI_Talent_S_Hutao_05.png',
      desc: [
        '<bold>蝶引来生</bold>施加的<bold>彼岸蝶舞</bold>状态结束后，队伍中所有角色(不包括胡桃自己)的暴击率提升12%，持续8秒。'
      ],
      data: null
    },
    {
      title: '血之灶火',
      image: '/image/char/talent/UI_Talent_S_Hutao_06.png',
      desc: [
        '胡桃的生命值低于或等于50%时，获得33%<pyro>火元素伤害加成</pyro>。'
      ],
      data: null
    },
    {
      title: '多多益善',
      image: '/image/char/talent/UI_Talent_Cook_ExtraFailedItem.png',
      desc: [
        '完美烹饪食物时，有18%的概率额外获得一个「奇怪的」品质同种料理。'
      ],
      data: null
    }
  ]
}
