// 角色天赋数据

/**
 * 在desc中 可以使用以下标签
 * <bold>文字强调</bold>
 * <pyro>火元素伤害</pyro>
 * <hydro>水元素伤害</hydro>
 * <geo>岩元素伤害</geo>
 * <electro>雷元素伤害</electro>
 * <cyro>冰元素伤害</cyro>
 * <ameno>风元素伤害</ameno
 */
export default {
  element: 'ameno', // 元素 参考上方标签名称
  data: [
    {
      title: '普通攻击·神代射术',
      image: '/image/char/talent/Skill_A_02.png',
      desc: [
        '<bold>普通攻击</bold>',
        '进行至多六段的连续弓箭射击。',
        '',
        '<bold>重击</bold>',
        '进行伤害更高、更为精准的<bold>瞄准射击</bold>。',
        '瞄准时，眷顾天地的风会在箭矢上持续积聚。聚满了风之力的箭矢会造成<ameno>风元素伤害</ameno>。',
        '',
        '<bold>下落攻击</bold>',
        '从空中射出箭雨，并迅速下坠冲击地面，在落地时造成范围伤害。',
      ],
      data: [
        {
          title: '一段伤害',
          data: [
            '20.38% + 20.38%',
            '22.04% + 22.04%',
            '23.7% + 23.7%',
            '26.07% + 26.07%',
            '27.73% + 27.73%',
            '29.63% + 29.63%',
            '32.23% + 32.23%',
            '34.84% + 34.84%',
            '37.45% + 37.45%',
            '40.29% + 40.29%',
            '43.55% + 43.55%',
            '47.38% + 47.38%',
            '51.21% + 51.21%',
            '55.05% + 55.05%',
            '59.23% + 59.23%'
          ]
        },
        {
          title: '二段伤害',
          data: [
            '44.38%',
            '47.99%',
            '51.6%',
            '56.76%',
            '60.37%',
            '64.5%',
            '70.18%',
            '75.85%',
            '81.53%',
            '87.72%',
            '94.82%',
            '103.16%',
            '111.5%',
            '119.85%',
            '128.95%'
          ]
        },
        {
          title: '三段伤害',
          data: [
            '52.37%',
            '56.64%',
            '60.9%',
            '66.99%',
            '71.25%',
            '76.13%',
            '82.82%',
            '89.52%',
            '96.22%',
            '103.53%',
            '111.9%',
            '121.75%',
            '131.6%',
            '141.45%',
            '152.19%'
          ]
        },
        {
          title: '四段伤害',
          data: [
            '26.06% + 26.06%',
            '28.18% + 28.18%',
            '30.3% + 30.3%',
            '33.33% + 33.33%',
            '35.45% + 35.45%',
            '37.87% + 37.87%',
            '41.21% + 41.21%',
            '44.54% + 44.54%',
            '47.87% + 47.87%',
            '51.51% + 51.51%',
            '55.68% + 55.68%',
            '60.58% + 60.58%',
            '65.48% + 65.48%',
            '70.37% + 70.37%',
            '75.72% + 75.72%'
          ]
        },
        {
          title: '五段伤害',
          data: [
            '50.65%',
            '54.78%',
            '58.9%',
            '64.79%',
            '68.91%',
            '73.63%',
            '80.1%',
            '86.58%',
            '93.06%',
            '100.13%',
            '108.23%',
            '117.75%',
            '127.28%',
            '136.8%',
            '147.19%'
          ]
        },
        {
          title: '六段伤害',
          data: [
            '70.95%',
            '76.73%',
            '82.5%',
            '90.75%',
            '96.53%',
            '103.13%',
            '112.2%',
            '121.28%',
            '130.35%',
            '140.25%',
            '151.59%',
            '164.93%',
            '178.27%',
            '191.61%',
            '206.17%'
          ]
        },
        {
          title: '瞄准射击',
          data: [
            '43.86%',
            '47.43%',
            '51%',
            '56.1%',
            '59.67%',
            '63.75%',
            '69.36%',
            '74.97%',
            '80.58%',
            '86.7%',
            '93.71%',
            '101.96%',
            '110.21%',
            '118.45%',
            '127.45%'
          ]
        },
        {
          title: '满蓄力瞄准射击',
          data: [
            '124%',
            '133.3%',
            '142.6%',
            '155%',
            '164.3%',
            '173.6%',
            '186%',
            '198.4%',
            '210.8%',
            '223.2%',
            '236.1%',
            '252.96%',
            '269.82%',
            '286.69%',
            '303.55%'
          ]
        },
        {
          title: '下坠期间伤害',
          data: [
            '56.83%',
            '61.45%',
            '66.08%',
            '72.69%',
            '77.31%',
            '82.6%',
            '89.87%',
            '97.14%',
            '104.41%',
            '112.34%',
            '120.27%',
            '128.2%',
            '136.12%',
            '144.05%',
            '151.98%'
          ]
        },
        {
          title: '低空/高空坠地冲击伤害',
          data: [
            '113.63% / 141.93%',
            '122.88% / 153.49%',
            '132.13% / 165.04%',
            '145.35% / 181.54%',
            '154.59% / 193.1%',
            '165.17% / 206.3%',
            '179.7% / 224.45%',
            '194.23% / 242.61%',
            '208.77% / 260.76%',
            '224.62% / 280.57%',
            '240.48% / 300.37%',
            '256.34% / 320.18%',
            '272.19% / 339.98%',
            '288.05% / 359.79%',
            '303.9% / 379.59%'
          ]
        }
      ]
    },
    {
      title: '高天之歌',
      image: '/image/char/talent/UI_Talent_U_Venti_01.png',
      desc: [
        '呼唤与诗和乐协鸣的风，将在尘泥中行走的事物送上高空吧。',
        '',
        '<bold>点按</bold>',
        '在敌人所在的位置唤出风域，造成<amoeno>风元素范围伤害</amoeno>，并击飞其中的敌人。',
        '',
        '<bold>长按</bold>',
        '以自身为中心，唤出更大的风域，造成<amoeno>风元素范围伤害</amoeno>，并击飞其中的敌人。',
        '长按施放后，温迪会乘风飞到空中。',
        '',
        '被高天之歌击飞的敌人，在短时间内会缓慢坠落。',
        '',
        '在人与神还同行于大地的时代，无数的歌曲传遍四方的天空。这是早已被遗忘的曲调。'
      ],
      data: [
        {
          title: '点按伤害',
          data: [
            '276%',
            '296.7%',
            '317.4%',
            '345%',
            '365.7%',
            '386.4%',
            '414%',
            '441.6%',
            '469.2%',
            '496.8%',
            '524.4%',
            '552%',
            '586.5%',
            '621%',
            '655.5%'
          ]
        },
        {
          title: '点按冷却时间',
          data: [
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒',
            '6.0秒'
          ]
        },
        {
          title: '长按伤害',
          data: [
            '380%',
            '408.5%',
            '437%',
            '475%',
            '503.5%',
            '532%',
            '570%',
            '608%',
            '646%',
            '684%',
            '722%',
            '760%',
            '807.5%',
            '855%',
            '902.5%'
          ]
        },
        {
          title: '长按冷却时间',
          data: [
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒'
          ]
        }
      ]
    },
    {
      title: '风神之诗',
      image: '/image/char/talent/UI_Talent_U_Venti_02.png',
      desc: [
        '射出千风汇聚而成的箭矢，在前方造出巨大的暴风之眼，将敌人卷入，持续造成风元素伤害。',
        '',
        '<bold>元素转化</bold>',
        '若暴风之眼在技能持续期间接触了<hydro>水元素</hydro>/<pyro>火元素</pyro>/<cyro>冰元素</cyro>/<electro>雷元素</electro>，则会获得对应元素属性，额外造成该元素的附加伤害。',
        '元素转化在技能持续期间仅会发生一次。',
        '',
        '称颂风之神的诗篇有许多已经佚失。其中这一首描述的是他与风的力量。'
      ],
      data: [
        {
          title: '持续伤害',
          data: [
            '37.6%',
            '40.42%',
            '43.24%',
            '47%',
            '49.82%',
            '52.64%',
            '56.4%',
            '60.16%',
            '63.92%',
            '67.68%',
            '71.44%',
            '75.2%',
            '79.9%',
            '84.6%',
            '89.3%'
          ]
        },
        {
          title: '附加元素伤害',
          data: [
            '18.8%',
            '20.21%',
            '21.62%',
            '23.5%',
            '24.91%',
            '26.32%',
            '28.2%',
            '30.08%',
            '31.96%',
            '33.84%',
            '35.72%',
            '37.6%',
            '39.95%',
            '42.3%',
            '44.65%'
          ]
        },
        {
          title: '持续时间',
          data: [
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒',
            '8.0秒'
          ]
        },
        {
          title: '冷却时间',
          data: [
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒'
          ]
        },
        {
          title: '元素能量',
          data: [
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60'
          ]
        }
      ]
    },
    {
      title: '绪风之拥',
      image: '/image/char/talent/UI_Talent_S_Venti_05.png',
      desc: [
        '长按<bold>高天之歌</bold>后，会产生上升气流，持续20秒。'
      ],
      data: null
    },
    {
      title: '暴风之眼',
      image: '/image/char/talent/UI_Talent_S_Venti_06.png',
      desc: [
        '<bold>风神之诗</bold>效果结束后，会为温迪恢复15点元素能量；',
        '若产生了元素转化，则同样为队伍中所有对应元素的角色恢复15点元素能量。'
      ],
      data: null
    },
    {
      title: '恒风随行',
      image: '/image/char/talent/UI_Talent_Explore_FlyStaminaReduction.png',
      desc: [
        '队伍中自己的角色滑翔消耗的体力降低20%。',
        '无法与效果完全相同的固有天赋叠加。'
      ],
      data: null
    }
  ]
}
