// 角色天赋数据

/**
 * 在desc中 可以使用以下标签
 * <bold>文字强调</bold>
 * <pyro>火元素伤害</pyro>
 * <hydro>水元素伤害</hydro>
 * <geo>岩元素伤害</geo>
 * <electro>雷元素伤害</electro>
 * <cyro>冰元素伤害</cyro>
 * <ameno>风元素伤害</ameno
 */
export default {
  element: 'pyro', // 元素 参考上方标签名称
  data: [
    {
      title: '普通攻击·砰砰',
      image: '/image/char/talent/Skill_A_Catalyst_MD.png',
      desc: [
        '<bold>普通攻击</bold>',
        '投掷在碰撞后会爆炸的好东西！进行至多三段的炸弹攻击，造成<pyro>火元素范围伤害</pyro>。',
        '',
        '<bold>重击</bold>',
        '消耗一定体力，短暂咏唱后，轰击敌人，造成<pyro>火元素范围伤害</pyro>。',
        '',
        '<bold>下落攻击</bold>',
        '凝聚烈焰的力量，从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成<pyro>火元素范围伤害</pyro>。'
      ],
      data: [
        {
          title: '一段伤害',
          data: [
            '72.16%',
            '77.57%',
            '82.98%',
            '90.2%',
            '95.61%',
            '101.02%',
            '108.24%',
            '115.46%',
            '122.67%',
            '129.89%',
            '137.39%',
            '147.21%',
            '157.02%',
            '166.83%',
            '176.65%'
          ]
        },
        {
          title: '二段伤害',
          data: [
            '62.4%',
            '67.08%',
            '71.76%',
            '78%',
            '82.68%',
            '87.36%',
            '93.6%',
            '99.84%',
            '106.08%',
            '112.32%',
            '118.81%',
            '127.3%',
            '135.78%',
            '144.27%',
            '152.76%'
          ]
        },
        {
          title: '三段伤害',
          data: [
            '89.92%',
            '96.66%',
            '103.41%',
            '112.4%',
            '119.14%',
            '125.89%',
            '134.88%',
            '143.87%',
            '152.86%',
            '161.86%',
            '171.21%',
            '183.44%',
            '195.67%',
            '207.9%',
            '220.12%'
          ]
        },
        {
          title: '重击伤害',
          data: [
            '157.36%',
            '169.16%',
            '180.96%',
            '196.7%',
            '208.5%',
            '220.3%',
            '236.04%',
            '251.78%',
            '267.51%',
            '283.25%',
            '299.61%',
            '321.01%',
            '342.42%',
            '363.82%',
            '385.22%'
          ]
        },
        {
          title: '重击体力消耗',
          data: [
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点',
            '50.0点'
          ]
        },
        {
          title: '下坠期间伤害',
          data: [
            '56.83%',
            '61.45%',
            '66.08%',
            '72.69%',
            '77.31%',
            '82.6%',
            '89.87%',
            '97.14%',
            '104.41%',
            '112.34%',
            '120.27%',
            '128.2%',
            '136.12%',
            '144.05%',
            '151.98%'
          ]
        },
        {
          title: '低空/高空坠地冲击伤害',
          data: [
            '113.63% / 141.93%',
            '122.88% / 153.49%',
            '132.13% / 165.04%',
            '145.35% / 181.54%',
            '154.59% / 193.1%',
            '165.17% / 206.3%',
            '179.7% / 224.45%',
            '194.23% / 242.61%',
            '208.77% / 260.76%',
            '224.62% / 280.57%',
            '240.48% / 300.37%',
            '256.34% / 320.18%',
            '272.19% / 339.98%',
            '288.05% / 359.79%',
            '303.9% / 379.59%'
          ]
        }
      ]
    },
    {
      title: '蹦蹦炸弹',
      image: '/image/char/talent/UI_Talent_U_Klee_01.png',
      desc: [
        '投出带来无限快乐的蹦蹦炸弹！',
        '蹦蹦炸弹会连续弹跳三次，每次弹跳都会引发爆炸，造成<pyro>火元素范围伤害</pyro>。',
        '',
        '第三次弹跳后，将分裂成许多诡雷。',
        '诡雷会在接触到敌人或一段时间后爆炸，造成<pyro>火元素范围伤害</pyro>。',
        '',
        '初始拥有2次可使用次数。',
        '',
        '蹦蹦是可莉的「好朋友」…可莉总是忍不住向人介绍他们。'
      ],
      data: [
        {
          title: '蹦蹦炸弹伤害',
          data: [
            '95.2%',
            '102.34%',
            '109.48%',
            '119%',
            '126.14%',
            '133.28%',
            '142.8%',
            '152.32%',
            '161.84%',
            '171.36%',
            '180.88%',
            '190.4%',
            '202.3%',
            '214.2%',
            '226.1%'
          ]
        },
        {
          title: '诡雷伤害',
          data: [
            '32.8%',
            '35.26%',
            '37.72%',
            '41%',
            '43.46%',
            '45.92%',
            '49.2%',
            '52.48%',
            '55.76%',
            '59.04%',
            '62.32%',
            '65.6%',
            '69.7%',
            '73.8%',
            '77.9%'
          ]
        },
        {
          title: '诡雷持续时间',
          data: [
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒'
          ]
        },
        {
          title: '冷却时间',
          data: [
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒',
            '20.0秒'
          ]
        }
      ]
    },
    {
      title: '轰轰火花',
      image: '/image/char/talent/UI_Talent_U_Klee_02.png',
      desc: [
        '可莉火力全开！在技能持续时间内，不停召唤轰轰火花攻击附近的敌人，造成<pyro>火元素范围伤害</pyro>。',
        '',
        '骑士团的人相信，可莉从来不被自己的炸弹所伤，一定有幸运星眷顾着她吧…'
      ],
      data: [
        {
          title: '轰轰火花伤害',
          data: [
            '42.64%',
            '45.84%',
            '49.04%',
            '53.3%',
            '56.5%',
            '59.7%',
            '63.96%',
            '68.22%',
            '72.49%',
            '76.75%',
            '81.02%',
            '85.28%',
            '90.61%',
            '95.94%',
            '101.27%'
          ]
        },
        {
          title: '持续时间',
          data: [
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒',
            '10.0秒'
          ]
        },
        {
          title: '冷却时间',
          data: [
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒',
            '15.0秒'
          ]
        },
        {
          title: '元素能量',
          data: [
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60',
            '60'
          ]
        }
      ]
    },
    {
      title: '砰砰礼物',
      image: '/image/char/talent/UI_Talent_S_Klee_05.png',
      desc: [
        '<bold>蹦蹦炸弹</bold>与普通攻击造成伤害时，有50%的几率赋予可莉一朵爆裂火花。',
        '施放重击时将消耗爆裂火花，使本次重击不消耗体力，造成的伤害提升50%。'
      ],
      data: null
    },
    {
      title: '火花无限',
      image: '/image/char/talent/UI_Talent_S_Klee_06.png',
      desc: [
        '可莉的重击造成暴击后，为队伍中所有角色恢复2点元素能量。'
      ],
      data: null
    },
    {
      title: '全是宝藏',
      image: '/image/char/talent/UI_Talent_Collect_Local_Mengde.png',
      desc: [
        '在小地图上显示周围的<bold>蒙德区域特产</bold>的位置。'
      ],
      data: null
    }
  ]
}
